// Dynamic Systems.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "DOPRI5.h"
#include "ODE.h"
#include <iostream>

using namespace std;


int main()
{	
	double* x = new double[2]{ 1,0 };
	double* y = new double[2]{ 0,0 };
	double* p = new double[4]{ 0,1,-1,0 };

	DOPRI5 dopr;
	dopr.portrait(2, 4, 0, x, p, Linear<2>::rhsp(),"D:\\test.txt");
	/*
	Linear<2>::rhs(0, x, y, p);

	cout << y[0] << ' ' << y[1];*/
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
